papers/privacy/presentations/hardEvidence/hardEvidence.org
#+TITLE:    Game Theory: Hard evidence\footnote{License: CC Attribution ShareAlike 4.0}
#+AUTHOR:    Christoph Schottmüller
#+EMAIL:     christoph@worknotebook.home
#+DATE:       
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport


#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+BEAMER_FRAME_LEVEL: 2
#+latex_header: \mode<beamer>{\useinnertheme{rounded}\usecolortheme{rose}\usecolortheme{dolphin}\setbeamertemplate{navigation symbols}{}\setbeamertemplate{footline}[frame number]{}}
#+latex_header: \mode<beamer>{\usepackage{amsmath}\usepackage{ae,aecompl} \usepackage{sgamevar,url}}


* Introduction

** Introduction
- hard evidence
  - A has private information but can disclose it truthfully to B
- examples
  - financial reports by companies
  - disclose income by showing tax statement
  - certify quality by an expert/rating agency (possibly costly)
- questions
  - what information should you (not) disclose?
  - when are mandatory disclosure or privacy rules optimal?

* Unraveling

** A simple example

1. a manager A privately learns the value of the firm $v\in V=\{v_1,\dots,v_n\}$ with $v_1<v_2<\dots<v_n$
2. A can disclose his information to the board B
3. B pays a bonus to A depending on the expected value of the firm (the higher B expects $v$ to be the higher the bonus)

\vspace*{1cm}

What is the (perfect Bayesian) equilibrium of the game?


** A more general setup

- A's payoff is $\pi(v,b)$ where $b$ is B's belief (probability distribution over  $V=\{v_1,\dots,v_n\}$) in stage 3 
*** Assumptions 						    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
    - $\pi$ increases in $v$
    - $\pi$ "increases" in $b$: $\pi(v,b)>\pi(v,b')$ if $b\neq b'$ first order stochastically dominates $b'$:

      $$\sum_{v_j\leq v}b(v_j)\leq \sum_{v_j\leq v}b'(v_j)\qquad\text{ for all }v$$

*** 							    :B_ignoreheading:
    :PROPERTIES:
    :BEAMER_env: ignoreheading
    :END:

- A can certify some subset of $V$ in stage 2 (the true $v$ must be in the set he certifies)
  - example:  A can certify "$v$ is in $\{v_2,v_4\}$" if $v=v_2$
*** Assumption 
A can certify that the value is at least $v$, i.e. if $v=v_i$ then the set $\{v_i,v_{i+1},\dots,v_n\}$ is certifiable

** Unraveling theorem in the more general setup

*** 	Unraveling						  :B_theorem:
    :PROPERTIES:
    :BEAMER_env: theorem
    :END:
The equilibrium involves full information revelation and pessimistic beliefs.
*** 							    :B_ignoreheading:
    :PROPERTIES:
    :BEAMER_env: ignoreheading
    :END:

- pessimistic beliefs: for any certified set, B beliefs that $v$ is the lowest $v_i$ in the set

\textbf{Proof. } 
# see Bolton Dewatripont, p.178

* Partial Unraveling

** Costly verification I

- say disclosure comes at cost $c>0$
- for which $v_i$ will A disclose, for which not?

** Costly verification II

- let $v'$ be the highest $\tilde{v}$ that satisfies
$$\hspace*{2cm}\mathbb{E}[v| v\leq \tilde{v}] <c$$
- equilibrium:
  -  not disclose for $v\leq v'$
  - disclose for $v> v'$

