papers/privacy/presentations/hardEvidence/hardEvidence.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-16 Di 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Game Theory: Hard evidence\footnote{License: CC Attribution ShareAlike 4.0}</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christoph Schottmüller" />
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">

    <p style="text-align: justify;">
      
  <a id="subtitle" href="https://schottmueller.github.io/index.html">Home</a>
  <a id="subtitle" href="https://schottmueller.github.io/research.html">Research</a>
  <a id="subtitle" href="https://schottmueller.github.io/teaching.html">Teaching</a>
  <a id="subtitle" href="https://schottmueller.github.io/misc.html">Misc</a>

  <span> </span>
</div>

</p>

</div>
</div>
</div>
<div id="content">
<h1 class="title">Game Theory: Hard evidence\footnote{License: CC Attribution ShareAlike 4.0}</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde4472e">1. Introduction</a>
<ul>
<li><a href="#orge531f3a">1.1. Introduction</a></li>
</ul>
</li>
<li><a href="#org5717676">2. Unraveling</a>
<ul>
<li><a href="#org9b1bf73">2.1. A simple example</a></li>
<li><a href="#org8a9f04f">2.2. A more general setup</a></li>
<li><a href="#org0feb737">2.3. Unraveling theorem in the more general setup</a></li>
</ul>
</li>
<li><a href="#org9eb8516">3. Partial Unraveling</a>
<ul>
<li><a href="#orgf7ec40d">3.1. Costly verification I</a></li>
<li><a href="#org25510df">3.2. Costly verification II</a></li>
<li><a href="#org7681521">3.3. Dye's model I</a></li>
<li><a href="#orgccad299">3.4. Dye's model II</a></li>
<li><a href="#org8b1c1a4">3.5. Dye's model III</a></li>
<li><a href="#org216b3bb">3.6. Dye's model IV</a></li>
</ul>
</li>
<li><a href="#orgfc80804">4. Limited Communication</a>
<ul>
<li><a href="#org39e53a5">4.1. Limited Communication  I</a></li>
<li><a href="#org438aed3">4.2. Limited Communication  II</a></li>
</ul>
</li>
<li><a href="#org93823af">5. An investment example (BDL)</a>
<ul>
<li><a href="#orgbff065e">5.1. Investment decisions I</a></li>
<li><a href="#orgf0b9018">5.2. Investment decisions II</a></li>
<li><a href="#org2bd1967">5.3. Investment decisions III</a></li>
</ul>
</li>
<li><a href="#org31643b3">6. Revision questions and exercise</a>
<ul>
<li><a href="#org356699d">6.1. Revision questions</a></li>
<li><a href="#org8eea4c3">6.2. Exercise I</a></li>
<li><a href="#org495600b">6.3. Exercise II</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgde4472e" class="outline-2">
<h2 id="orgde4472e"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge531f3a" class="outline-3">
<h3 id="orge531f3a"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>hard evidence
<ul class="org-ul">
<li>A has private information but can disclose it truthfully to B</li>
</ul></li>
<li>examples
<ul class="org-ul">
<li>financial reports by companies</li>
<li>disclose income by showing tax statement</li>
<li>certify quality by an expert/rating agency (possibly costly)</li>
</ul></li>
<li>questions
<ul class="org-ul">
<li>what information should you (not) disclose?</li>
<li>when are mandatory disclosure or privacy rules optimal?</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5717676" class="outline-2">
<h2 id="org5717676"><span class="section-number-2">2</span> Unraveling</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9b1bf73" class="outline-3">
<h3 id="org9b1bf73"><span class="section-number-3">2.1</span> A simple example</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>a manager A privately learns the value of the firm \(v\in V=\{v_1,\dots,v_n\}\) with \(v_1<v_2<\dots<v_n\)</li>
<li>A can disclose his information to the board B</li>
<li>B pays a bonus to A depending on the expected value of the firm (the higher B expects \(v\) to be the higher the bonus)</li>
</ol>

<p>
\vspace*{1cm}
</p>

<p>
What is the (perfect Bayesian) equilibrium of the game?
</p>
</div>
</div>


<div id="outline-container-org8a9f04f" class="outline-3">
<h3 id="org8a9f04f"><span class="section-number-3">2.2</span> A more general setup</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>A's payoff is \(\pi(v,b)\) where \(b\) is B's belief (probability distribution over  \(V=\{v_1,\dots,v_n\}\)) in stage 3</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgb3a77c1"></a>Assumptions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_block">B_block</span></span><br />
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>\(\pi\) increases in \(v\)</li>
<li><p>
\(\pi\) "increases" in \(b\): \(\pi(v,b)>\pi(v,b')\) if \(b\neq b'\) first order stochastically dominates \(b'\):
</p>

<p>
\[\sum_{v_j\leq v}b(v_j)\leq \sum_{v_j\leq v}b'(v_j)\qquad\text{ for all }v\]
</p></li>
</ul>
</div>
</li>

<li><a id="orgb147b92"></a>:B<sub>ignoreheading</sub>:<br />
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>A can certify some subset of \(V\) in stage 2 (the true \(v\) must be in the set he certifies)
<ul class="org-ul">
<li>example:  A can certify "\(v\) is in \(\{v_2,v_4\}\)" if \(v=v_2\)</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org5a9e172"></a>Assumption<br />
<div class="outline-text-4" id="text-2-2-3">
<p>
A can certify that the value is at least \(v\), i.e. if \(v=v_i\) then the set \(\{v_i,v_{i+1},\dots,v_n\}\) is certifiable
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0feb737" class="outline-3">
<h3 id="org0feb737"><span class="section-number-3">2.3</span> Unraveling theorem in the more general setup</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<ol class="org-ol">
<li><a id="org9180a7d"></a>Unraveling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_theorem">B_theorem</span></span><br />
<div class="outline-text-4" id="text-2-3-1">
<p>
The equilibrium involves full information revelation and pessimistic beliefs.
</p>
</div>
</li>
<li><a id="org8617395"></a>:B<sub>ignoreheading</sub>:<br />
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>pessimistic beliefs: for any certified set, B beliefs that \(v\) is the lowest \(v_i\) in the set</li>
</ul>

<p>
\textbf{Proof. } 
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org9eb8516" class="outline-2">
<h2 id="org9eb8516"><span class="section-number-2">3</span> Partial Unraveling</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf7ec40d" class="outline-3">
<h3 id="orgf7ec40d"><span class="section-number-3">3.1</span> Costly verification I</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>say disclosure comes at cost \(c>0\)</li>
<li>for which \(v_i\) will A disclose, for which not?</li>
</ul>
</div>
</div>

<div id="outline-container-org25510df" class="outline-3">
<h3 id="org25510df"><span class="section-number-3">3.2</span> Costly verification II</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>let \(v'\) be the highest \(\tilde{v}\) that satisfies</li>
</ul>
<p>
\[\hspace*{2cm}\mathbb{E}[v| v\leq \tilde{v}] <c\]
</p>
<ul class="org-ul">
<li>equilibrium:
<ul class="org-ul">
<li>not disclose for \(v\leq v'\)</li>
<li>disclose for \(v> v'\)</li>
</ul></li>
</ul>
</div>
</div>
