papers/privacy/presentations/hardEvidence/hardEvidence.tex
% Created 2016-11-30 Wed 10:39
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\mode<beamer>{\useinnertheme{rounded}\usecolortheme{rose}\usecolortheme{dolphin}\setbeamertemplate{navigation symbols}{}\setbeamertemplate{footline}[frame number]{}}
\mode<beamer>{\usepackage{amsmath}\usepackage{ae,aecompl} \usepackage{sgamevar,url}}
\usetheme{default}
\author{Christoph Schottmüller}
\date{}
\title{Game Theory: Hard evidence\footnote{License: CC Attribution ShareAlike 4.0}}
\hypersetup{
 pdfauthor={Christoph Schottmüller},
 pdftitle={Game Theory: Hard evidence\footnote{License: CC Attribution ShareAlike 4.0}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}



\section{Introduction}
\label{sec:orgheadline2}

\begin{frame}[label={sec:orgheadline1}]{Introduction}
\begin{itemize}
\item hard evidence
\begin{itemize}
\item A has private information but can disclose it truthfully to B
\end{itemize}
\item examples
\begin{itemize}
\item financial reports by companies
\item disclose income by showing tax statement
\item certify quality by an expert/rating agency (possibly costly)
\end{itemize}
\item questions
\begin{itemize}
\item what information should you (not) disclose?
\item when are mandatory disclosure or privacy rules optimal?
\end{itemize}
\end{itemize}
\end{frame}

\section{Unraveling}
\label{sec:orgheadline6}

\begin{frame}[label={sec:orgheadline3}]{A simple example}
\begin{enumerate}
\item a manager A privately learns the value of the firm \(v\in V=\{v_1,\dots,v_n\}\) with \(v_1<v_2<\dots<v_n\)
\item A can disclose his information to the board B
\item B pays a bonus to A depending on the expected value of the firm (the higher B expects \(v\) to be the higher the bonus)
\end{enumerate}

\vspace*{1cm}

What is the (perfect Bayesian) equilibrium of the game?
\end{frame}


\begin{frame}[label={sec:orgheadline4}]{A more general setup}
\begin{itemize}
\item A's payoff is \(\pi(v,b)\) where \(b\) is B's belief (probability distribution over  \(V=\{v_1,\dots,v_n\}\)) in stage 3
\end{itemize}
\begin{block}{Assumptions}
\begin{itemize}
\item \(\pi\) increases in \(v\)
\item \(\pi\) "increases" in \(b\): \(\pi(v,b)>\pi(v,b')\) if \(b\neq b'\) first order stochastically dominates \(b'\):

\(\sum_{v_j\leq v}b(v_j)\leq \sum_{v_j\leq v}b'(v_j)\qquad\text{ for all }v\)
\end{itemize}
\end{block}

\begin{itemize}
\item A can certify some subset of \(V\) in stage 2 (the true \(v\) must be in the set he certifies)
\begin{itemize}
\item example:  A can certify "\(v\) is in \(\{v_2,v_4\}\)" if \(v=v_2\)
\end{itemize}
\end{itemize}
\begin{block}{Assumption}
A can certify that the value is at least \(v\), i.e. if \(v=v_i\) then the set \(\{v_i,v_{i+1},\dots,v_n\}\) is certifiable
\end{block}
\end{frame}

\begin{frame}[label={sec:orgheadline5}]{Unraveling theorem in the more general setup}
\begin{theorem}[Unraveling]
The equilibrium involves full information revelation and pessimistic beliefs.
\end{theorem}
\begin{itemize}
\item pessimistic beliefs: for any certified set, B beliefs that \(v\) is the lowest \(v_i\) in the set
\end{itemize}

\textbf{Proof. } 
\end{frame}

\section{Partial Unraveling}
\label{sec:orgheadline13}

\begin{frame}[label={sec:orgheadline7}]{Costly verification I}
\begin{itemize}
\item say disclosure comes at cost \(c>0\)
\item for which \(v_i\) will A disclose, for which not?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline8}]{Costly verification II}
\begin{itemize}
\item let \(v'\) be the highest \(\tilde{v}\) that satisfies
\end{itemize}
\(\hspace*{2cm}\mathbb{E}[v| v\leq \tilde{v}] <c\)
\begin{itemize}
\item equilibrium:
\begin{itemize}
\item not disclose for \(v\leq v'\)
\item disclose for \(v> v'\)
\end{itemize}
\end{itemize}
\end{frame}
