papers/privacy/presentations/hardEvidence/hardEvidence.org
** Dye's model I

- back to simple disclosure: A cannot certify sets but at best the actual $v$
- A knows $v$ with probability $q$ 
- A does not know $v$ with probability $1-q$ 
- prior belief over $\{v_1,\dots,v_n\}$ is denoted by $f$ (with full support)
- A's payoff is $\alpha v+\bar{v}$ where $\alpha\geq 0$ and $\bar v$ is B's expectation over $v$ in stage 3
- same timing as in simple example (note that A cannot disclose anything if he does not know $v$)

** Dye's model II
*** 	partial disclosure 					  :B_example:
    :PROPERTIES:
    :BEAMER_env: example
    :END:
- $V=\{1,2,9\}$ and $f(v_i)=1/3$ for $v_i\in V$
- $q=3/4$ and $\alpha=1$
- Equilibrium: A discloses if $v=9$ and does not disclose otherwise:
  - given this, what is the prob of non-disclosure? 
# 1/4+3/4*2/3=3/4
  - if non-disclosure is observed what is probability that A does not know $v$?
# 1/4 / 3/4 = 1/3
  - if non-disclosure is observed what is probability that $v=1$, that $v=2$?
# 3/4*1/3 / 3/4 = 1/3
  - what is $\bar{v}$ when observing non-disclosure?
# (1+2+ (1+2+9)/3 ) / 3 = 7/3
  - what is A's payoff of not disclosing if $v=2$?
# 7/3 + 2 > 2 + 2

** Dye's model III

- let $v_i$ be defined such that

$$\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \geq v_i$$
$$\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \leq v_{i+1}$$

- this $v_i$ exists
  - LHS is above RHS for $v_i = v_1$
  - LHS is below RHS for $v_i = v_n$
  
*** Partial disclosure 						  :B_theorem:
    :PROPERTIES:
    :BEAMER_env: theorem
    :END:
It is an equilibrium that all types above $v_i$ disclose and those below do not.

*** 							    :B_ignoreheading:
    :PROPERTIES:
    :BEAMER_env: ignoreheading
    :END:

** Dye's model IV

- say $v$ is an asset value or stock price that is traded
- suppose there is a stage 4 where $v$ becomes known (asset pays out, project finishes, end of year report)
- how is strategic disclosure different from "disclose everything"?
  - strategic:
    - price of asset drops in stage 2/3 if no disclosure (no news is bad news)
    - without disclosure: uncertainty/volatility about asset value in 4
  - disclose everything:
    - price stays constant (in 2/3) if no news
    - price drops if bad news but then no uncertainty about asset value in 4
- empirical test for strategic disclosure: does a price drop lead to more volatility?


* Limited Communication 

**  Limited Communication  I

- a course has 2 topics
- student A can either understand or not understand a topic ($V=\{0,1\}$ for each topic)
- for each topic the probability of understanding $f(1)=1/2$ (and values are independent across topics) 
- the exam has limited length: A can communicate at most 1 topic to teacher B
- with probability $1-q=1/4$ there is miscommunication and the teacher cannot understand/receive what the student says in the exam (even if A understands the topic)
- A gets a grade equal to B's ex post expected number of topics A has understood

**  Limited Communication  II

- what is the probability that "understanding" can be communicated if A chooses the topic of the exam?
# $3/4*(1-1/4)=9/16$
- what is B's belief in case $v=1$ is (not) communicated if A chooses the topic?
# v=1: prob 2 understood: 1/3, prob 1 understood: 2/3 -> expected value 4/3
# v\neq 1: prob 0 understood: 1/4/(7/16)=4/7, prob 2 understood: (1/4*1/4)/(7/16)=1/7, prob 1 understood: (1/4*1/2)/(7/16)=2/7 -> expected value 4/7
- what is the probability that "understanding" can be communicated if B chooses the topic of the exam randomly?
# 3/4*1/2=3/8=6/16
-  what is B's belief in case $v=1$ is (not) communicated if B chooses the topic randomly? 
# v=1: prob 2: 1/2, prob 1: 1/2 -> expected value 1.5
# v\neq 1: prob  2: (1/4*1/4)/(5/8)=1/10, prob 1: (1/2+1/2*1/4)*(1/2)/(5/8)=1/2, prob 0: (1/4*1/4+3/4*1/4)/(5/8)=2/5 -> expected value 7/10
- does the grade distribution have more variance if A or if B chooses the topic?
# A chooses: 9/16*(4/3-1)^2+7/16*(4/7-1)^2=1/16+9/112 = 0.1429
# B chooses: 3/8*(1.5-1)^2+5/8*(7/10-1)^2=3/32+9/160 = 0.15 
- who should choose the topic if the grades should be as informative as possible about the the student's understanding?
# B as variance gives the spread and more spread means that more informative signal

* An investment example (BDL)

