papers/privacy/presentations/hardEvidence/hardEvidence.html

<div id="outline-container-org7681521" class="outline-3">
<h3 id="org7681521"><span class="section-number-3">3.3</span> Dye's model I</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>back to simple disclosure: A cannot certify sets but at best the actual \(v\)</li>
<li>A knows \(v\) with probability \(q\)</li>
<li>A does not know \(v\) with probability \(1-q\)</li>
<li>prior belief over \(\{v_1,\dots,v_n\}\) is denoted by \(f\) (with full support)</li>
<li>A's payoff is \(\alpha v+\bar{v}\) where \(\alpha\geq 0\) and \(\bar v\) is B's expectation over \(v\) in stage 3</li>
<li>same timing as in simple example (note that A cannot disclose anything if he does not know \(v\))</li>
</ul>
</div>
</div>

<div id="outline-container-orgccad299" class="outline-3">
<h3 id="orgccad299"><span class="section-number-3">3.4</span> Dye's model II</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<ol class="org-ol">
<li><a id="orgc09b369"></a>partial disclosure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_example">B_example</span></span><br />
<div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>\(V=\{1,2,9\}\) and \(f(v_i)=1/3\) for \(v_i\in V\)</li>
<li>\(q=3/4\) and \(\alpha=1\)</li>
<li>Equilibrium: A discloses if \(v=9\) and does not disclose otherwise:
<ul class="org-ul">
<li>given this, what is the prob of non-disclosure?</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>if non-disclosure is observed what is probability that A does not know \(v\)?</li>
</ul>

<ul class="org-ul">
<li>if non-disclosure is observed what is probability that \(v=1\), that \(v=2\)?</li>
</ul>

<ul class="org-ul">
<li>what is \(\bar{v}\) when observing non-disclosure?</li>
</ul>

<ul class="org-ul">
<li>what is A's payoff of not disclosing if \(v=2\)?</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org8b1c1a4" class="outline-3">
<h3 id="org8b1c1a4"><span class="section-number-3">3.5</span> Dye's model III</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>let \(v_i\) be defined such that</li>
</ul>

<p>
\[\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \geq v_i\]
\[\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \leq v_{i+1}\]
</p>

<ul class="org-ul">
<li>this \(v_i\) exists
<ul class="org-ul">
<li>LHS is above RHS for \(v_i = v_1\)</li>
<li>LHS is below RHS for \(v_i = v_n\)</li>
</ul></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org735ceac"></a>Partial disclosure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_theorem">B_theorem</span></span><br />
<div class="outline-text-4" id="text-3-5-1">
<p>
It is an equilibrium that all types above \(v_i\) disclose and those below do not.
</p>
</div>
</li>

<li><a id="org1715345"></a>:B<sub>ignoreheading</sub>:<br />
<div class="outline-text-4" id="text-3-5-2">
</div>
</li>
</ol>
</div>

<div id="outline-container-org216b3bb" class="outline-3">
<h3 id="org216b3bb"><span class="section-number-3">3.6</span> Dye's model IV</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>say \(v\) is an asset value or stock price that is traded</li>
<li>suppose there is a stage 4 where \(v\) becomes known (asset pays out, project finishes, end of year report)</li>
<li>how is strategic disclosure different from "disclose everything"?
<ul class="org-ul">
<li>strategic:
<ul class="org-ul">
<li>price of asset drops in stage 2/3 if no disclosure (no news is bad news)</li>
<li>without disclosure: uncertainty/volatility about asset value in 4</li>
</ul></li>
<li>disclose everything:
<ul class="org-ul">
<li>price stays constant (in 2/3) if no news</li>
<li>price drops if bad news but then no uncertainty about asset value in 4</li>
</ul></li>
</ul></li>
<li>empirical test for strategic disclosure: does a price drop lead to more volatility?</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgfc80804" class="outline-2">
<h2 id="orgfc80804"><span class="section-number-2">4</span> Limited Communication</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org39e53a5" class="outline-3">
<h3 id="org39e53a5"><span class="section-number-3">4.1</span> Limited Communication  I</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>a course has 2 topics</li>
<li>student A can either understand or not understand a topic (\(V=\{0,1\}\) for each topic)</li>
<li>for each topic the probability of understanding \(f(1)=1/2\) (and values are independent across topics)</li>
<li>the exam has limited length: A can communicate at most 1 topic to teacher B</li>
<li>with probability \(1-q=1/4\) there is miscommunication and the teacher cannot understand/receive what the student says in the exam (even if A understands the topic)</li>
<li>A gets a grade equal to B's ex post expected number of topics A has understood</li>
</ul>
</div>
</div>

<div id="outline-container-org438aed3" class="outline-3">
<h3 id="org438aed3"><span class="section-number-3">4.2</span> Limited Communication  II</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>what is the probability that "understanding" can be communicated if A chooses the topic of the exam?</li>
</ul>

<ul class="org-ul">
<li>what is B's belief in case \(v=1\) is (not) communicated if A chooses the topic?</li>
</ul>

<ul class="org-ul">
<li>what is the probability that "understanding" can be communicated if B chooses the topic of the exam randomly?</li>
</ul>

<ul class="org-ul">
<li>what is B's belief in case \(v=1\) is (not) communicated if B chooses the topic randomly?</li>
</ul>

<ul class="org-ul">
<li>does the grade distribution have more variance if A or if B chooses the topic?</li>
</ul>

<ul class="org-ul">
<li>who should choose the topic if the grades should be as informative as possible about the the student's understanding?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org93823af" class="outline-2">
<h2 id="org93823af"><span class="section-number-2">5</span> An investment example (BDL)</h2>
<div class="outline-text-2" id="text-5">
</div>
