papers/privacy/presentations/hardEvidence/hardEvidence.tex

\begin{frame}[label={sec:orgheadline9}]{Dye's model I}
\begin{itemize}
\item back to simple disclosure: A cannot certify sets but at best the actual \(v\)
\item A knows \(v\) with probability \(q\)
\item A does not know \(v\) with probability \(1-q\)
\item prior belief over \(\{v_1,\dots,v_n\}\) is denoted by \(f\) (with full support)
\item A's payoff is \(\alpha v+\bar{v}\) where \(\alpha\geq 0\) and \(\bar v\) is B's expectation over \(v\) in stage 3
\item same timing as in simple example (note that A cannot disclose anything if he does not know \(v\))
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline10}]{Dye's model II}
\begin{example}[partial disclosure]
\begin{itemize}
\item \(V=\{1,2,9\}\) and \(f(v_i)=1/3\) for \(v_i\in V\)
\item \(q=3/4\) and \(\alpha=1\)
\item Equilibrium: A discloses if \(v=9\) and does not disclose otherwise:
\begin{itemize}
\item given this, what is the prob of non-disclosure?

\item if non-disclosure is observed what is probability that A does not know \(v\)?

\item if non-disclosure is observed what is probability that \(v=1\), that \(v=2\)?

\item what is \(\bar{v}\) when observing non-disclosure?

\item what is A's payoff of not disclosing if \(v=2\)?
\end{itemize}
\end{itemize}
\end{example}
\end{frame}

\begin{frame}[label={sec:orgheadline11}]{Dye's model III}
\begin{itemize}
\item let \(v_i\) be defined such that
\end{itemize}

\(\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \geq v_i\)
\(\hspace*{1cm}\mathbb{E}[v|\mbox{ v has no evidence or }v\leq v_i\}] \leq v_{i+1}\)

\begin{itemize}
\item this \(v_i\) exists
\begin{itemize}
\item LHS is above RHS for \(v_i = v_1\)
\item LHS is below RHS for \(v_i = v_n\)
\end{itemize}
\end{itemize}

\begin{theorem}[Partial disclosure]
It is an equilibrium that all types above \(v_i\) disclose and those below do not.
\end{theorem}
\end{frame}

\begin{frame}[label={sec:orgheadline12}]{Dye's model IV}
\begin{itemize}
\item say \(v\) is an asset value or stock price that is traded
\item suppose there is a stage 4 where \(v\) becomes known (asset pays out, project finishes, end of year report)
\item how is strategic disclosure different from "disclose everything"?
\begin{itemize}
\item strategic:
\begin{itemize}
\item price of asset drops in stage 2/3 if no disclosure (no news is bad news)
\item without disclosure: uncertainty/volatility about asset value in 4
\end{itemize}
\item disclose everything:
\begin{itemize}
\item price stays constant (in 2/3) if no news
\item price drops if bad news but then no uncertainty about asset value in 4
\end{itemize}
\end{itemize}
\item empirical test for strategic disclosure: does a price drop lead to more volatility?
\end{itemize}
\end{frame}


\section{Limited Communication}
\label{sec:orgheadline16}

\begin{frame}[label={sec:orgheadline14}]{Limited Communication  I}
\begin{itemize}
\item a course has 2 topics
\item student A can either understand or not understand a topic (\(V=\{0,1\}\) for each topic)
\item for each topic the probability of understanding \(f(1)=1/2\) (and values are independent across topics)
\item the exam has limited length: A can communicate at most 1 topic to teacher B
\item with probability \(1-q=1/4\) there is miscommunication and the teacher cannot understand/receive what the student says in the exam (even if A understands the topic)
\item A gets a grade equal to B's ex post expected number of topics A has understood
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline15}]{Limited Communication  II}
\begin{itemize}
\item what is the probability that "understanding" can be communicated if A chooses the topic of the exam?

\item what is B's belief in case \(v=1\) is (not) communicated if A chooses the topic?

\item what is the probability that "understanding" can be communicated if B chooses the topic of the exam randomly?

\item what is B's belief in case \(v=1\) is (not) communicated if B chooses the topic randomly?

\item does the grade distribution have more variance if A or if B chooses the topic?

\item who should choose the topic if the grades should be as informative as possible about the the student's understanding?
\end{itemize}
\end{frame}

\section{An investment example (BDL)}
\label{sec:orgheadline20}
