papers/privacy/presentations/hardEvidence/hardEvidence.org
** Investment decisions I
- say A can choose between two technologies
  - technology 1 gives $v=4$ for sure
  - technology 2 gives $v=6$ and $v=0$ with probability 1/2 each
- A's objective is to maximize $\bar{v}$ (i.e. $\alpha=0$ for simplicity)
- A has evidence with probability $q$ as before
- the value realizes in stage 4 and goes to B

\vspace*{0.5cm}
- What is the efficient technology choice?

** Investment decisions II

- Is it an equilibrium to choose technology 1?
  - in such an equilibrium what is $\bar{v}$ without disclosure?
# 4
  - what is A's payoff when he chooses technology 2?
# q*1/2*6+q*1/2*4+(1-q)*4>4 hence, no eq

- Is it an equilibrium to choose technology 2?
  - what will A disclose in such an equilibrium?
# only good news i.e. 6
  - in such an equilibrium what is $\bar{v}$ without disclosure?
# (q*1/2*0+(1-q)*(6/2+0/2)) / (q/2+1-q) = 3*(1-q)/(1-q/2)
  - what is A's expected payoff?
# 6*q/2+(1-q/2)*3*(1-q)/(1-q/2)=3
  - what is A's expected payoff from deviating to technology 1?
# always disclose 4: q*4+(1-q)*3*(1-q)/(1-q/2) which is less than 3 if q is small; for high q, mixed strategy equilibria

** Investment decisions III
- general result: A engages in excessive risk taking
  - enjoy upside risk
  - hide downside risk by not disclosing

  - roughly: 
    - $\hat v$ be the belief if no disclosure
    - A chooses $\max\{v,\hat v\}$ \rightarrow convex function of $v$
    - A is risk lover


* Revision questions and exercise

** Revision questions

- what is information unraveling and why might it occur?
- what could prevent total information unraveling and why?
- explain Dye's model setup
- why is it more informative if the examiner chooses the topic and not the student?
- why might entrepreneurs choose too risky projects?

\vspace*{0.5cm}

- reading: nothing particularly, I used Eddie Dekel's slides (https://sites.google.com/site/eddiedekelsite/pres_address_2016_slides/pres_address_2016_slides.pdf?attredirects=0&d=1) and section 5.1.5 in Bolton/Dewatripont's "Contract theory" book as sources. You can find more references in these two sources.

** Exercise I

An entrepreneur (E) has to sell his project to a perfectly competitive and risk neutral financial market before it matures. With probability $p$ the project is good and makes a profit of 1. With probability $1-p$ the project is bad and makes zero profits. With probability $q$ the entrepreneur finds out whether his project is good before he sells it and in this case he has evidence to document the project value.

- When will E document the value?
# only if it is good
- What is the market price of the project in case there is (no) evidence?
# (1-q)*p/((1-q)*p+1-p)
- What is the market price of the project in case it is documented to be good?
# 1
- What is the expected market price of the project?
# p
** Exercise II
- Say, E is risk averse and obtains Bernoulli utility $u(m)$ when selling the project at price $m$ where $u$ is strictly concave. Does E benefit or suffer from the possibility of learning the project value?
# from an ex ante point of view, he suffers: instead of receiving the expected value $p$, he obtains a lottery with expected value $p$ which -- by risk aversion -- is worse
- Let $u(m)=\sqrt{m}$. Suppose E has to choose (before the game above is played) one of the following two projects below. Which will he choose? Is this efficient?
  - P1: $p=1/4$ and $q=7/8$
  - P2: $p=0.16$ and $q=0$  
# U(P1)=25/32*sqrt(1/25)+7/32*1=3/8; U(P2)=sqrt(0.16)=0.4>3/8
