papers/privacy/presentations/hardEvidence/hardEvidence.html
<div id="outline-container-orgbff065e" class="outline-3">
<h3 id="orgbff065e"><span class="section-number-3">5.1</span> Investment decisions I</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>say A can choose between two technologies
<ul class="org-ul">
<li>technology 1 gives \(v=4\) for sure</li>
<li>technology 2 gives \(v=6\) and \(v=0\) with probability 1/2 each</li>
</ul></li>
<li>A's objective is to maximize \(\bar{v}\) (i.e. \(\alpha=0\) for simplicity)</li>
<li>A has evidence with probability \(q\) as before</li>
<li>the value realizes in stage 4 and goes to B</li>
</ul>

<p>
\vspace*{0.5cm}
</p>
<ul class="org-ul">
<li>What is the efficient technology choice?</li>
</ul>
</div>
</div>

<div id="outline-container-orgf0b9018" class="outline-3">
<h3 id="orgf0b9018"><span class="section-number-3">5.2</span> Investment decisions II</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Is it an equilibrium to choose technology 1?
<ul class="org-ul">
<li>in such an equilibrium what is \(\bar{v}\) without disclosure?</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>what is A's payoff when he chooses technology 2?</li>
</ul>

<ul class="org-ul">
<li>Is it an equilibrium to choose technology 2?
<ul class="org-ul">
<li>what will A disclose in such an equilibrium?</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>in such an equilibrium what is \(\bar{v}\) without disclosure?</li>
</ul>

<ul class="org-ul">
<li>what is A's expected payoff?</li>
</ul>

<ul class="org-ul">
<li>what is A's expected payoff from deviating to technology 1?</li>
</ul>
</div>
</div>

<div id="outline-container-org2bd1967" class="outline-3">
<h3 id="org2bd1967"><span class="section-number-3">5.3</span> Investment decisions III</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>general result: A engages in excessive risk taking
<ul class="org-ul">
<li>enjoy upside risk</li>
<li>hide downside risk by not disclosing</li>

<li>roughly: 
<ul class="org-ul">
<li>\(\hat v\) be the belief if no disclosure</li>
<li>A chooses \(\max\{v,\hat v\}\) &rarr; convex function of \(v\)</li>
<li>A is risk lover</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org31643b3" class="outline-2">
<h2 id="org31643b3"><span class="section-number-2">6</span> Revision questions and exercise</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org356699d" class="outline-3">
<h3 id="org356699d"><span class="section-number-3">6.1</span> Revision questions</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>what is information unraveling and why might it occur?</li>
<li>what could prevent total information unraveling and why?</li>
<li>explain Dye's model setup</li>
<li>why is it more informative if the examiner chooses the topic and not the student?</li>
<li>why might entrepreneurs choose too risky projects?</li>
</ul>

<p>
\vspace*{0.5cm}
</p>

<ul class="org-ul">
<li>reading: nothing particularly, I used Eddie Dekel's slides (<a href="https://sites.google.com/site/eddiedekelsite/pres_address_2016_slides/pres_address_2016_slides.pdf?attredirects=0&amp;d=1">https://sites.google.com/site/eddiedekelsite/pres_address_2016_slides/pres_address_2016_slides.pdf?attredirects=0&amp;d=1</a>) and section 5.1.5 in Bolton/Dewatripont's "Contract theory" book as sources. You can find more references in these two sources.</li>
</ul>
</div>
</div>

<div id="outline-container-org8eea4c3" class="outline-3">
<h3 id="org8eea4c3"><span class="section-number-3">6.2</span> Exercise I</h3>
<div class="outline-text-3" id="text-6-2">
<p>
An entrepreneur (E) has to sell his project to a perfectly competitive and risk neutral financial market before it matures. With probability \(p\) the project is good and makes a profit of 1. With probability \(1-p\) the project is bad and makes zero profits. With probability \(q\) the entrepreneur finds out whether his project is good before he sells it and in this case he has evidence to document the project value.
</p>

<ul class="org-ul">
<li>When will E document the value?</li>
</ul>

<ul class="org-ul">
<li>What is the market price of the project in case there is (no) evidence?</li>
</ul>

<ul class="org-ul">
<li>What is the market price of the project in case it is documented to be good?</li>
</ul>

<ul class="org-ul">
<li>What is the expected market price of the project?</li>
</ul>
</div>
</div>
<div id="outline-container-org495600b" class="outline-3">
<h3 id="org495600b"><span class="section-number-3">6.3</span> Exercise II</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Say, E is risk averse and obtains Bernoulli utility \(u(m)\) when selling the project at price \(m\) where \(u\) is strictly concave. Does E benefit or suffer from the possibility of learning the project value?</li>
</ul>

<ul class="org-ul">
<li>Let \(u(m)=\sqrt{m}\). Suppose E has to choose (before the game above is played) one of the following two projects below. Which will he choose? Is this efficient?
<ul class="org-ul">
<li>P1: \(p=1/4\) and \(q=7/8\)</li>
<li>P2: \(p=0.16\) and \(q=0\)</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
