papers/privacy/presentations/hardEvidence/hardEvidence.tex

\begin{frame}[label={sec:orgheadline17}]{Investment decisions I}
\begin{itemize}
\item say A can choose between two technologies
\begin{itemize}
\item technology 1 gives \(v=4\) for sure
\item technology 2 gives \(v=6\) and \(v=0\) with probability 1/2 each
\end{itemize}
\item A's objective is to maximize \(\bar{v}\) (i.e. \(\alpha=0\) for simplicity)
\item A has evidence with probability \(q\) as before
\item the value realizes in stage 4 and goes to B
\end{itemize}

\vspace*{0.5cm}
\begin{itemize}
\item What is the efficient technology choice?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline18}]{Investment decisions II}
\begin{itemize}
\item Is it an equilibrium to choose technology 1?
\begin{itemize}
\item in such an equilibrium what is \(\bar{v}\) without disclosure?

\item what is A's payoff when he chooses technology 2?
\end{itemize}

\item Is it an equilibrium to choose technology 2?
\begin{itemize}
\item what will A disclose in such an equilibrium?

\item in such an equilibrium what is \(\bar{v}\) without disclosure?

\item what is A's expected payoff?

\item what is A's expected payoff from deviating to technology 1?
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline19}]{Investment decisions III}
\begin{itemize}
\item general result: A engages in excessive risk taking
\begin{itemize}
\item enjoy upside risk
\item hide downside risk by not disclosing

\item roughly: 
\begin{itemize}
\item \(\hat v\) be the belief if no disclosure
\item A chooses \(\max\{v,\hat v\}\) \(\rightarrow\) convex function of \(v\)
\item A is risk lover
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}


\section{Revision questions and exercise}
\label{sec:orgheadline24}

\begin{frame}[label={sec:orgheadline21}]{Revision questions}
\begin{itemize}
\item what is information unraveling and why might it occur?
\item what could prevent total information unraveling and why?
\item explain Dye's model setup
\item why is it more informative if the examiner chooses the topic and not the student?
\item why might entrepreneurs choose too risky projects?
\end{itemize}

\vspace*{0.5cm}

\begin{itemize}
\item reading: nothing particularly, I used Eddie Dekel's slides (\url{https://sites.google.com/site/eddiedekelsite/pres_address_2016_slides/pres_address_2016_slides.pdf?attredirects=0&d=1}) and section 5.1.5 in Bolton/Dewatripont's "Contract theory" book as sources. You can find more references in these two sources.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline22}]{Exercise I}
An entrepreneur (E) has to sell his project to a perfectly competitive and risk neutral financial market before it matures. With probability \(p\) the project is good and makes a profit of 1. With probability \(1-p\) the project is bad and makes zero profits. With probability \(q\) the entrepreneur finds out whether his project is good before he sells it and in this case he has evidence to document the project value.

\begin{itemize}
\item When will E document the value?

\item What is the market price of the project in case there is (no) evidence?

\item What is the market price of the project in case it is documented to be good?

\item What is the expected market price of the project?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline23}]{Exercise II}
\begin{itemize}
\item Say, E is risk averse and obtains Bernoulli utility \(u(m)\) when selling the project at price \(m\) where \(u\) is strictly concave. Does E benefit or suffer from the possibility of learning the project value?

\item Let \(u(m)=\sqrt{m}\). Suppose E has to choose (before the game above is played) one of the following two projects below. Which will he choose? Is this efficient?
\begin{itemize}
\item P1: \(p=1/4\) and \(q=7/8\)
\item P2: \(p=0.16\) and \(q=0\)
\end{itemize}
\end{itemize}
\end{frame}
\end{document}